<?php
/**1. С помощью цикла while вывести все числа в промежутке от 0 до 100, 
которые делятся на 3 без остатка. */
echo 'ЗАДАНИЕ 1';
while ($i <= 100) {
    if (fmod($i, 3) == 0) {
        echo $i.'<br/>';
    }
    $i++;
};

/* С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так: 
0 – это ноль. 1 – нечётное число. 2 – чётное число. */
echo '<br/>'.'ЗАДАНИЕ 2'.'<br/>';  
do {
    if ($j == 0) {
        $j = 0;
        echo $j.' - это ноль'.'<br/>';
    } else if (fmod($j+1, 2) == 0){
        echo $j.' - это нечётное число'.'<br/>';
    } else if (fmod($j, 2) == 0){
        echo $j.' - это чётное число'.'<br/>';
    }
    $j++;
} while ($j<=10);

/* Объявить массив, в котором в качестве ключей будут использоваться названия областей, 
а в качестве значений – массивы с названиями городов из соответствующей области.
Вывести в цикле значения массива, чтобы результат был таким:
Московская область: Москва, Зеленоград, Клин.
Ленинградская область: Санкт-Петербург, Всеволожск, Павловск, Кронштадт.
Рязанская область…(названия городов можно найти на maps.yandex.ru)
*/
echo '<br/>'.'ЗАДАНИЕ 3'.'<br/>';
$towns = [];
$towns['Московская область'] = ['Москва', 'Зеленоград', 'Клин'];
$towns['Ленинградская область'] = ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'];
$towns['Рязанская область'] = ['Рязань', 'Скопин', 'Касимов', 'Ряжск'];
$towns['Пензенская область'] = ['Пенза', 'Кузнецк', 'Каменка', 'Низний ломов'];
$towns['Саратовская область'] = ['Саратов', 'Энгельс', 'Вольск', 'Балашов', 'Петровск'];

foreach($towns as $key => $region) {
    $res = '';
    foreach ($region as $key2 => $town) {
        $res = $res.$town.', ';
    }
    echo $key.': '.$res.'<br/>';
}

?>
