<?php
/**1. С помощью цикла while вывести все числа в промежутке от 0 до 100, 
которые делятся на 3 без остатка. */
echo 'ЗАДАНИЕ 1';
while ($i <= 100) {
    if (fmod($i, 3) == 0) {
        echo $i.'<br/>';
    }
    $i++;
};

/* С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так: 
0 – это ноль. 1 – нечётное число. 2 – чётное число. */
echo '<br/>'.'ЗАДАНИЕ 2'.'<br/>';  
do {
    if ($j == 0) {
        $j = 0;
        echo $j.' - это ноль'.'<br/>';
    } else if (fmod($j+1, 2) == 0){
        echo $j.' - это нечётное число'.'<br/>';
    } else if (fmod($j, 2) == 0){
        echo $j.' - это чётное число'.'<br/>';
    }
    $j++;
} while ($j<=10);

/* Объявить массив, в котором в качестве ключей будут использоваться названия областей, 
а в качестве значений – массивы с названиями городов из соответствующей области.
Вывести в цикле значения массива, чтобы результат был таким:
Московская область: Москва, Зеленоград, Клин.
Ленинградская область: Санкт-Петербург, Всеволожск, Павловск, Кронштадт.
Рязанская область…(названия городов можно найти на maps.yandex.ru)
*/
echo '<br/>'.'ЗАДАНИЕ 3'.'<br/>';
$towns = [];
$towns['Московская область'] = ['Москва', 'Зеленоград', 'Клин'];
$towns['Ленинградская область'] = ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'];
$towns['Рязанская область'] = ['Рязань', 'Скопин', 'Касимов', 'Ряжск'];
$towns['Пензенская область'] = ['Пенза', 'Кузнецк', 'Каменка', 'Низний ломов'];
$towns['Саратовская область'] = ['Саратов', 'Энгельс', 'Вольск', 'Балашов', 'Петровск'];

foreach($towns as $key => $region) {
    $res = '';
    foreach ($region as $key2 => $town) {
        $res = $res.$town.', ';
    }
    echo $key.': '.$res.'<br/>';
};

/* Объявить массив, индексами которого являются буквы русского языка, 
а значениями – соответствующие латинские буквосочетания 
(‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
Написать функцию транслитерации строк.
*/
echo '<br/>'.'ЗАДАНИЕ 4'.'<br/>';

$abc = ['а'=> 'a', 'б'=> 'b', 'в'=> 'v',
        'г'=> 'g', 'д'=> 'd', 'е'=> 'e',
        'ё'=> 'yo', 'ж'=> 'g', 'з'=> 'z',
        'и'=> 'i', 'й'=> 'i\'', 'к'=> 'k', 
        'л'=> 'l', 'м'=> 'm', 'н'=> 'n', 
        'о'=> 'o', 'п'=> 'p', 'р'=> 'r', 
        'с'=> 's', 'т'=> 't', 'у'=> 'u', 
        'ф'=> 'f', 'х'=> 'h', 'ц'=> 'c', 
        'ч'=> 'ch', 'ш'=> 'sch', 'щ'=> 'shch', 
        'ъ'=> '\'', 'ы'=> 'y', 'ь'=> '\'', 
        'э'=> 'e', 'ю'=> 'yu', 'я'=> 'ya',
        ' '=>' '];
function translit($text) {
    global $abc;
    $text = mb_strtolower($text);
    $str = preg_split('//u', $text, 0, PREG_SPLIT_NO_EMPTY);
    $res = '';
    foreach($str as $key => $letter) {
        $res = $res.$abc[$letter];
    };
    return $res;
};

echo translit('пьющий мужик поехал на щенячьей упряжКЕ'); //p'yushchii' mugik poehal na shchenyach'ei' upryagke

/* Написать функцию, которая заменяет в строке пробелы на подчеркивания 
и возвращает видоизмененную строчку.
*/
echo '<br/>'.'<br/>'.'ЗАДАНИЕ 5'.'<br/>';

function replace_naprobel($text) {
    $str_ = str_replace(' ', '_', $text);
    return $str_;
}

echo replace_naprobel('Например вот такой текст с пробелами'); //Например_вот_такой_текст_с_пробелами

/* В имеющемся шаблоне сайта заменить статичное меню (ul - li) на генерируемое через PHP. 
Необходимо представить пункты меню как элементы массива и вывести их циклом. 
Подумать, как можно реализовать меню с вложенными подменю? Попробовать его реализовать.
*/
echo '<br/>'.'<br/>'.'ЗАДАНИЕ 6'.'<br/>';

$menu = [];
$menu['Main menu'] = ['First submenu', 'Second submenu', 'Third submenu'];
$menu['Categories'] = ['Processors', 'Motherboards', 'Notebooks'];
$menu['Contacts'] = ['Address', 'Social', 'Telephone'];

function ul_li_generate($arr) {   
        foreach($arr as $key => $menuname) {
            if (is_array($menuname)) {
                echo '<ul><b>'.$key.'</b>';
                ul_li_generate($menuname);
            } else {
                echo '<li>'.$menuname.'</li>';
            };
        };
        echo '</ul>';
};
ul_li_generate($menu);

//Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. 
echo '<br/>'.'<br/>'.'ЗАДАНИЕ 7'.'<br/>';
for ($z=0; $z<10; var_dump($z++)){};

//*Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К». 
echo '<br/>'.'<br/>'.'ЗАДАНИЕ 8'.'<br/>';

?>
