<?php

/* 1. Объявить две целочисленные переменные $a и $b и задать им произвольные начальные значения. 
Затем написать скрипт, который работает по следующему принципу:
Если $a и $b положительные, вывести их разность.
Если $а и $b отрицательные, вывести их произведение.
Если $а и $b разных знаков, вывести их сумму.*/

$a = -5;
$b = -9;
if ($a >= 0 && $b >= 0) {
    echo $a - $b;
} else if ($a < 0 && $b < 0) {
    echo $a * $b;
} else {
    echo $a + $b;
}
echo '<br>';
// или так
$c = ($a >= 0 && $b >= 0) ? ($a - $b) : (($a < 0 && $b < 0) ? ($a * $b) : ($a + $b));
echo $c;
echo '<br>';

/* 2. Присвоить переменной $а значение в промежутке [0..15]. 
С помощью оператора switch организовать вывод чисел от $a до 15.*/


$a = 2;
Switch ($a) {
    Case 1: echo '1'.'<br>';
    Case 2: echo '2'.'<br>';
    Case 3: echo '3'.'<br>';
    Case 4: echo '4'.'<br>';
    Case 5: echo '5'.'<br>';
    Case 6: echo '6'.'<br>';
    Case 7: echo '7'.'<br>';
    Case 8: echo '8'.'<br>';
    Case 9: echo '9'.'<br>';
    Case 10: echo '10'.'<br>';
    Case 11: echo '11'.'<br>';
    Case 12: echo '12'.'<br>';
    Case 13: echo '13'.'<br>';
    Case 14: echo '14'.'<br>';
    Default: echo '15'.'<br>';
}

/* 3. Реализовать основные 4 арифметические операции в виде функций с двумя параметрами. 
Обязательно использовать оператор return.*/

function sum($a, $b) {
    return $a + $b;
};
function differ($a, $b) {
    return $a - $b;
};
function multipl($a, $b) {
    return $a * $b;
};
function divide($a, $b) {
    return $a / $b;
};

echo sum(8, 3);
echo '<br>';
echo differ(8, 3);
echo '<br>';
echo multipl(8, 3);
echo '<br>';
echo divide(8, 3);
echo '<br>';

/* 4. Реализовать функцию с тремя параметрами: function mathOperation($arg1, $arg2, $operation), 
где $arg1, $arg2 – значения аргументов, $operation – строка с названием операции. 
В зависимости от переданного значения операции выполнить одну из арифметических операций
(использовать функции из пункта 3) и вернуть полученное значение (использовать switch).
*/
?>